[
  {
    "title": "AITA for telling my nephews no cake after they were told they could have cake?",
    "author": "Ok-Spare-9358",
    "selftext": "This happened a week ago and I have no remorse but my in laws are still upset over it. \n\nMy sister in laws birthday was last week. I spent the day making it special for her, driving her around to her favorite stores and spots around town until eventually her friends had a suprise birthday party for her that was our last stop. \n\nShe had way too much to drink and I had to drag her out of the party when her mom called me multiple times to get home to pick up our kids. It took me an hour and her friends kept booing me but eventually we were on our way home but she kept demanding I take her to other friends houses the whole time. I said no, it's 8:30pm and we need to pick up our kids. She was upset at me but ended up passing out anyway.\n\nWe got to my mother in laws house to pick up the kids and while I was in the bathroom, I heard my mother in law talking to my sister in laws sons and telling them that they can have cake at my house (they were going to stay the night at my house so my sister in law can have a peaceful night).\n\nI was already so frustrated and tired and when I heard that, I was done. I walked out and helped everyone get ready. My mother in law was handing me the cake and asked \"Oh, can you take this?\" I just looked at her and said \"No.\" And walked away. \n\nThe boys all pouted and the older one started crying. I just didn't care. I got them all packed up and told them that it's bedtime and we aren't having sugar but we can have cake tomorrow. The older one bawled again and had a fit the whole way home. \n\nThe next day, I brought them over, all the kids had cake, everything was fine. But my SIL and MIL think I overreacted, that I was being horrible and mean to the boys. I wanted to tell them so bad that saying no is not a bad thing but I just kept my mouth shut. It's been a week and they are still bothered by it.\n\nSo reddit... AITA?",
    "url": "https://reddit.com/r/AmItheAsshole/comments/1m3e5ty/aita_for_telling_my_nephews_no_cake_after_they/",
    "score": 1
  },
  {
    "title": "AITA for Helping a Stranger with Their Groceries Even Though It Got Me in Trouble with My Boss?",
    "author": "badgyalpearl",
    "selftext": "So, I (25M) work at a small convenience store in a busy part of town. My job’s pretty straightforward—stock shelves, ring up customers, keep things tidy. I’m not exactly saving the world, but I try to be a decent person when I can. Yesterday, something happened, and I’m genuinely torn about whether I messed up here.\n\n\n\nI was on my break, sitting outside the store, when I saw this older lady (maybe 70s?) struggling with a bunch of grocery bags across the street. She was wobbling, trying to balance them while using a cane, and one bag ripped, spilling cans everywhere. People were just walking by, not even glancing at her. I don’t know, it just hit me hard seeing her struggle like that, so I jogged over to help. I picked up her stuff, offered to carry her bags, and walked her a couple blocks to her apartment. She was super sweet, kept thanking me, and even tried to give me a couple bucks (I said no way, of course). It probably took 15 minutes tops, but it felt like the right thing to do.\n\n\n\nHere’s the issue: my break is only 10 minutes, and my boss is a stickler for time. When I got back, he was pissed, saying I left the store understaffed during a rush. I tried explaining I was helping someone, but he didn’t care—said I should’ve clocked out if I was “playing hero” or just stayed put. I got a formal warning, and he cut my hours for next week as a “lesson.” I feel like I didn’t do anything wrong, but now I’m stressed about the hours thing since I’m saving up for school.\n\n\n\nI keep thinking about that lady, though. She said she lives alone and doesn’t have family nearby, and I can’t shake the feeling that those few minutes meant more to her than my boss’s rules. But maybe I was irresponsible? I could’ve just called someone over to help her instead. AITA for going out of my way to help her, knowing it might get me in trouble at work?",
    "url": "https://reddit.com/r/AmItheAsshole/comments/1m3e454/aita_for_helping_a_stranger_with_their_groceries/",
    "score": 1
  },
  {
    "title": "AITA for splitting the bill with my females friends ?",
    "author": "M_hadi0",
    "selftext": "I (20M) went to a cafeteria with my friends (4 males and 2 females) all of them ordered Hookahs and I didn't order one because I don't smoke/vape and ordered the same stuff they did order other than the Hookah, so the females started laughing without saying why, and later they said because I finished my milk shake the fastest and I didn't care at all, but then all of the sudden my male friends decided to split the between the 4 of us and they said some shit like I'm not a real man and \"when you get married go and split the bill with my wife\" not to mention that I haven't touched the shitty Hookah they ordered and all of them spent 2 hours mocking me",
    "url": "https://reddit.com/r/AmItheAsshole/comments/1m3dxyj/aita_for_splitting_the_bill_with_my_females/",
    "score": 1
  },
  {
    "title": "AITA I don't want my husband to come on my work trip",
    "author": "mb4mom",
    "selftext": "I (47F) travel a few days a week once a month for work. My husband (48M) has suggested in the past that he join me due to free flight and hotel room. Hotel paid by my company and i would use loyalty points/rewards for his flight. It's never worked out so not really an issue. Next month I'm traveling again and he seriously wants to come. He understands that my focus is work and being with my team and that since meals are pre planned I would be with my team and he'd be on his own. He says he doesn't mind having his own time to do whatever and explore the city. \nI just feel like he doesn't need to come. I enjoy having the time and space to myself in a hotel for a couple days. We travel a lot for pleasure and have hotel and air perks so the cost is not an issue- he travels for free either way. However if he joined on a work trip, there would now be added expense for his meals and tourist stuff. Money isn't a concern but just pointing out that this isn't the \"free trip\" he's thinking it is.  We have 2 teens (17F, 15F) who we haven't left home alone for more than a full day and while I think we could do it, still a concern/something to think about. Esp since 15 doesn't drive and we don't have family to rely on getting her places. \nShould I let it go or insist he doesn't come? ",
    "url": "https://reddit.com/r/AmItheAsshole/comments/1m3dvhr/aita_i_dont_want_my_husband_to_come_on_my_work/",
    "score": 2
  },
  {
    "title": "WIBTA if I chose to destroy my relationship with my mother over my school graduation?",
    "author": "Spritzies0",
    "selftext": "I (F17) have previously posted on this community about cutting contact with my mother \\[who had stage 2 cancer\\] completely, I can't find the account I used but here's how it's going.\n\n\\*\\*\\*Context\\*\\*\\*  \nA little bit of context is needed for this story. My mother left my sister and myself with my father when we were 6 and 8. She had severe depression and after 6 months away from us decided to proceed to divorce my father. She did countless heinous things - taking furniture, draining bank accounts and falsifying allegations of abuse. Court proceedings lasted 7 years, not on account of custody but financial compensation for the alleged abuse. My mother fought tooth and nail for money from my father but gladly moved away from my sister and I despite being awarded 50% custody. I won't delve into the whole story but due to the strained relationship I had with my mother and the toll I saw her actions take on my little sister, I decided I wanted to cut off all contact with her.\n\nBefore I was able to fully remove her from my life she was diagnosed with stage 2 cancer (Dec 2023) - a kind that would not respond to chemotherapy. She decided to undergo several surgeries and treatments to combat it. So, I began to try to renew the relationship I had with her and support her as she would be in my state while receiving treatment and surgeries. Now in remission, contact has become progressively less frequent, I do not see her for months at a time, sometimes 7, 8 or 9+. \n\n\\*\\*\\*Now\\*\\*\\*  \nBeing in my final year of school with graduation approaching I received a text from her asking if she could come and see me graduate in September (ironically graduation is October). Her efforts to contact or see myself or my sister at all have been minimal to non-existent since the beginning of this year - about 6 months ago. It's now been a week since she texted me, she has pursued my father, stepmother and extended family in court for money all whilst neglecting her relationship with her children. She is my mother, she doesn't have many people around her but has always failed to be present for my sister and I, missing big events like school acceptance as well as small mundane things like being sick or getting a good grade. I will never forgive her for never being there to see my sister and I grow up, for any of our accomplishments or difficulties. She consistently failed to show up for me and all those around her but I will ruin what ever relationship I still have with her if I refuse her attendance, not only on her account but mine as well. This is likely the last time I will try to preserve what ever semblance of a mother figure she was to me before I become an adult and no longer require her signatures and legal approval to do things.\n\nSo, WIBTA if I destroyed my relationship with my mother over my school graduation?",
    "url": "https://reddit.com/r/AmItheAsshole/comments/1m3duxt/wibta_if_i_chose_to_destroy_my_relationship_with/",
    "score": 1
  }
]